# Practice Exercise: Cleaning data & Transforming columns/features

## Context:
- The data is based on real anonymized Czech bank transactions and account info.
- We'll be focusing on practicing the data cleaning, columns transformations, and other techniques that we've learned in the course. 
- But here is the original task description of the dataset publishers:

*The bank wants to improve their services. For instance, the bank managers have only vague idea, who is a good client (whom to offer some additional services)   and who is a bad client (whom to watch carefully to minimize the bank losses). Fortunately, the bank stores data about their clients, the accounts (transactions within several months), the loans already granted, the credit cards issued. The bank managers hope to improve their understanding of customers and seek specific actions to improve services.*

- We've made minor changes on the data to fit this exercise, such as changing the column names. Check out the original source if you are interested in using this data for other purposes (https://data.world/lpetrocelli/czech-financial-dataset-real-anonymized-transactions)

## Dataset Description:

We'll work on three datasets (in three separate csv files):

  - **account**: each record describes static characteristics of an account
  - **transaction**: each record describes one transaction on an account
  - **district**: each record describes demographic characteristics of a district
  
In reality, the organizations like banks often have data stored in multiple datasets. Assume we want to study the transactional level data, we'll need to combine these three datasets together to have transactions data with account and district data.

## Objective: 
   - Examine/clean the individual dataset
   - Combine them into a single dataset, which is subject to more cleaning
   - Create new columns based on existing columns

By the end, the new dataset is ready for more analysis.

### 1. Import the libraries

In [302]:
import pandas as pd

### 2. Import the data from three csv files as DataFrames `account`, `district`, `trans`
Hint: 
- the `read_csv` function can automatically infer and load zip file, read its documentation of parameter `compression` if you are interested in details
- you may ignore the warning when reading the `trans.csv.zip` file. It is optional to follow the warning instructions to remove it.

In [304]:
account = pd.read_csv('account.csv')
district = pd.read_csv('district.csv')
trans = pd.read_csv('trans.csv')

C:\Users\jakeb\AppData\Local\Temp\ipykernel_25716\1315527715.py:3: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  trans = pd.read_csv('trans.csv')

### 3. Look at the info summary, head of each DataFrame

In [306]:
## Account

print(account.head(1))
print(account.describe())
account.info()

   account_id  district_id           frequency account_open_date  client_id
0         576           55  MONTHLY STATEMENTS        1993-01-01        692
         account_id  district_id     client_id
count   4500.000000  4500.000000   4500.000000
mean    2786.067556    37.310444   3381.096444
std     2313.811984    25.177217   2839.605215
min        1.000000     1.000000      1.000000
25%     1182.750000    13.000000   1424.750000
50%     2368.000000    38.000000   2861.000000
75%     3552.250000    60.000000   4287.250000
max    11382.000000    77.000000  13998.000000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4500 entries, 0 to 4499
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   account_id         4500 non-null   int64
 1   district_id        4500 non-null   int64
 2   frequency          4500 non-null   object
 3   account_open_date  4500 non-null   object
 4   client_id          4500 non-null   int64
dtypes: int64(3), object(2)
memory usage: 175.9+ KB

In [307]:
## District

print(district.head(1))
print(district.describe())
district.info()

   district_id district_name  region  population  average_salary  \
0            1   Hl.m. Praha  Prague     1204953         12541.0

   unemployment_rate  num_committed_crimes
0               0.43               99107.0
       district_id    population  average_salary  unemployment_rate  \
count    76.000000  7.600000e+01       66.000000          66.000000
mean     38.500000  1.336920e+05     8984.378788           3.836364
std      22.083176  1.378127e+05      782.234172           1.839614
min       1.000000  4.282100e+04     8110.000000           0.430000
25%      19.750000  8.472500e+04     8441.750000           2.455000
50%      38.500000  1.083910e+05     8755.500000           3.655000
75%      57.250000  1.382770e+05     9298.250000           4.670000
max      76.000000  1.204953e+06    12541.000000           9.400000

       num_committed_crimes
count             67.000000
mean            5164.567164
std            12069.628890
min              888.000000
25%             2081.000000
50%             2822.000000
75%             4505.000000
max            99107.000000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76 entries, 0 to 75
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   district_id           76 non-null     int64
 1   district_name         76 non-null     object
 2   region                76 non-null     object
 3   population            76 non-null     int64
 4   average_salary        66 non-null     float64
 5   unemployment_rate     66 non-null     float64
 6   num_committed_crimes  67 non-null     float64
dtypes: float64(3), int64(2), object(2)
memory usage: 4.3+ KB

In [308]:
## Trans

print(trans.head(1))
print(trans.describe())
trans.info()

   trans_id  account_id        date    type  operation_type  amount  balance  \
0    695247        2378  1993-01-01  CREDIT  CREDIT IN CASH   700.0    700.0

  description partner_bank  partner_account
0         NaN          NaN              NaN
           trans_id    account_id        amount       balance  partner_account
count  1.056320e+06  1.056320e+06  1.056320e+06  1.056320e+06     2.953890e+05
mean   1.335311e+06  2.936867e+03  5.924146e+03  3.851833e+04     4.567092e+07
std    1.227487e+06  2.477345e+03  9.522735e+03  2.211787e+04     3.066340e+07
min    1.000000e+00  1.000000e+00  0.000000e+00 -4.112570e+04     0.000000e+00
25%    4.302628e+05  1.204000e+03  1.359000e+02  2.240250e+04     1.782858e+07
50%    8.585065e+05  2.434000e+03  2.100000e+03  3.314340e+04     4.575095e+07
75%    2.060979e+06  3.660000e+03  6.800000e+03  4.960362e+04     7.201341e+07
max    3.682987e+06  1.138200e+04  8.740000e+04  2.096370e+05     9.999420e+07
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1056320 entries, 0 to 1056319
Data columns (total 10 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   trans_id         1056320 non-null  int64
 1   account_id       1056320 non-null  int64
 2   date             1056320 non-null  object
 3   type             1056320 non-null  object
 4   operation_type   873206 non-null   object
 5   amount           1056320 non-null  float64
 6   balance          1056320 non-null  float64
 7   description      574439 non-null   object
 8   partner_bank     273508 non-null   object
 9   partner_account  295389 non-null   float64
dtypes: float64(3), int64(2), object(5)
memory usage: 80.6+ MB

### 4. Check for the unique values and their counts in each column for the three DataFrames

In [310]:
account.nunique()

account_id           4500
district_id            77
frequency               3
account_open_date    1535
client_id            4500
dtype: int64

In [311]:
district.nunique()

district_id             76
district_name           76
region                   8
population              76
average_salary          65
unemployment_rate       63
num_committed_crimes    66
dtype: int64

In [312]:
trans.nunique()

trans_id           1056320
account_id            4500
date                  2191
type                     2
operation_type           5
amount               40400
balance             542739
description              8
partner_bank            13
partner_account       7665
dtype: int64

### 5. Check for duplicates in the three DataFrames

In [314]:
account[account.duplicated()]
account.duplicated().value_counts()

False    4500
Name: count, dtype: int64

In [315]:
district[district.duplicated()]
district.duplicated().value_counts()

False    76
Name: count, dtype: int64

In [316]:
trans[trans.duplicated()]
trans.duplicated().value_counts()

False    1056320
Name: count, dtype: int64

### 6. Convert column `account_open_date` in `account` and column `date` in `trans` into datetime dtypes

In [318]:
account['account_open_date'] = pd.to_datetime(account['account_open_date'])

In [319]:
trans['date'] = pd.to_datetime(trans['date'])

### 7. Convert the columns `region` and `district_name` in `district` to all uppercase

In [321]:
district[['region']]

             region
0            Prague
1   central Bohemia
2   central Bohemia
3   central Bohemia
4   central Bohemia
..              ...
71    north Moravia
72    north Moravia
73    north Moravia
74    north Moravia
75    north Moravia

[76 rows x 1 columns]

In [322]:
district['region'] = district['region'].str.upper()
district['district_name'] = district['district_name'].str.upper()

In [323]:
district[['district_name']]

      district_name
0       HL.M. PRAHA
1           BENESOV
2            BEROUN
3            KLADNO
4             KOLIN
..              ...
71          OLOMOUC
72            OPAVA
73  OSTRAVA - MESTO
74           PREROV
75          SUMPERK

[76 rows x 1 columns]

### 8. Check for missing data by columns in `account` using the `isna` method

In [325]:
account.isna().value_counts()

account_id  district_id  frequency  account_open_date  client_id
False       False        False      False              False        4500
Name: count, dtype: int64

### 9. Check for missing data by columns in `district` using the `isna` method

In [327]:
district.isna().value_counts()

district_id  district_name  region  population  average_salary  unemployment_rate  num_committed_crimes
False        False          False   False       False           False              False                   48
                                                                                   True                     9
                                                                True               False                    9
                                                True            False              False                    9
                                                                True               False                    1
Name: count, dtype: int64

`district` has numeric features that could have relationships with each other. Let's use iterative imputation on them.

#### Use `IterativeImputer` in `sklearn` to impute based on columns `population`, `average_salary`, `unemployment_rate`, `num_committed_crimes`

##### Import libraries

In [331]:
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

##### Build a list of columns that will be used for imputation, which are `population`, `average_salary`, `unemployment_rate`, `num_committed_crimes`
These are the columns that might be related to each other

In [333]:
impu_list = district[['population','average_salary','unemployment_rate','num_committed_crimes']]
impu_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76 entries, 0 to 75
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   population            76 non-null     int64
 1   average_salary        66 non-null     float64
 2   unemployment_rate     66 non-null     float64
 3   num_committed_crimes  67 non-null     float64
dtypes: float64(3), int64(1)
memory usage: 2.5 KB

##### Create `IterativeImputer` object and set its `min_value` and `max_value` parameters to be the minumum and maximum of corresponding columns

In [335]:
iter_imp = IterativeImputer(min_value=impu_list.min(), max_value=impu_list.max())

##### Apply the imputer to fit and transform the columns to an imputed NumPy array

In [337]:
imputed_num = iter_imp.fit_transform(impu_list)

##### Assign the imputed array back to the original DataFrame's columns

In [361]:
district[['population','average_salary','unemployment_rate','num_committed_crimes']] = imputed_num

    population  average_salary  unemployment_rate  num_committed_crimes
0    1204953.0    12541.000000           0.430000          99107.000000
1      88884.0     8813.969500           3.763873           2674.000000
2      75232.0     8980.000000           2.210000           2813.000000
3     149893.0     9753.000000           5.050000           6312.463514
4      95616.0     9307.000000           4.430000           1920.272861
..         ...             ...                ...                   ...
71    226122.0     9333.878734           4.790000           9208.000000
72    182027.0     8746.000000           3.740000           4433.000000
73    323870.0    10673.000000           5.440000          18347.000000
74    138032.0     8819.000000           5.660000           4505.000000
75    127369.0     8369.000000           3.818541           2807.000000

[76 rows x 4 columns]

##### Double check that the columns are imputed

In [363]:
district[['population','average_salary','unemployment_rate','num_committed_crimes']]

    population  average_salary  unemployment_rate  num_committed_crimes
0    1204953.0    12541.000000           0.430000          99107.000000
1      88884.0     8813.969500           3.763873           2674.000000
2      75232.0     8980.000000           2.210000           2813.000000
3     149893.0     9753.000000           5.050000           6312.463514
4      95616.0     9307.000000           4.430000           1920.272861
..         ...             ...                ...                   ...
71    226122.0     9333.878734           4.790000           9208.000000
72    182027.0     8746.000000           3.740000           4433.000000
73    323870.0    10673.000000           5.440000          18347.000000
74    138032.0     8819.000000           5.660000           4505.000000
75    127369.0     8369.000000           3.818541           2807.000000

[76 rows x 4 columns]

### 10. Check for missing data by columns in `trans` using the `isna` method

In [365]:
district.isna().value_counts()

district_id  district_name  region  population  average_salary  unemployment_rate  num_committed_crimes
False        False          False   False       False           False              False                   76
Name: count, dtype: int64

#### Divide the columns into numeric columns and categorical columns, then use the `fillna` method to fill numeric columns with -999, fill categorical columns with 'UNKNOWN'

### 11. Check for outliers in `district` using the `describe` method, then look at the histograms of the suspicious columns

#### Explore the outliers in the dataset

### 12. Check for outliers in `trans` using the `describe` method, then look at the histograms of the suspicious columns

#### Explore the outliers in the dataset

The DataFrame `account` doesn't have any columns that could have outliers, so we are not exploring it.

### 13. Merge (left join) `account` and `district` into a new DataFrame called `account_district` using their common columns

### 14. Check the information summary of `account_district`, any missing data?

#### Look at the rows with missing data in `account_district`

#### Use `SimpleImputer` from `sklearn` to impute the missing data in columns `population`, `average_salary`, `unemployment_rate`, `num_committed_crimes` with their means

#### Use `fillna` method to impute the missing data in columns `district_name` and `region` with 'UNKNOWN'

### 15. Merge (left join) `trans` and `account_district` into a new DataFrame called `all_data` using their common columns

#### Check the information summary of `all_data`

### 16. Create a new column `account_open_year` and assign it as the year from column `account_open_date`

### 17. Calculate the difference between columns `date` (transaction date) and `account_open_date`

### 18. Create a new column `account_age_days` and assign it as the difference in days between columns `date` (transaction date) and `account_open_date`

### 19. Create a new column `amount_category` by cutting the column `amount` into 3 equal-sized bins, and label the bins as 'low_amount', 'medium_amount', 'high_amount'

#### Verify the categories and their counts in `amount_category`

### 20. Create a new column `account_age_days_category` by cutting the column `account_age_days` into 5 equal-width bins

#### Verify the categories and their counts in `account_age_days_category`

#### Print out the first 20 rows of `all_data` to look at the newly added columns